Autodesk.Revit.DB.CompoundStructure.CanLayerBeStructuralMaterial(System.Int32)
Identifies if the input layer can be designated as defining the structural material for this structure.
Remarks:
Only core layers may be designated as defining the structural material.
layerIndex:
Index of a layer in the CompoundStructure.
Returns:
True if the input layer may be used to define the structural material and false otherwise.
Since:
2016

Autodesk.Revit.DB.CompoundStructure.CanLayerBeVariable(System.Int32)
Identifies if the input layer can be designated as a variable thickness layer.
Remarks:
A layer whose layer function is StructuralDeck may not be designated as a variable layer.
variableLayerIndex:
Index of a layer in the CompoundStructure.
Returns:
True if the input layer may be a variable thickness layer and false otherwise.
Since:
2016

Autodesk.Revit.DB.CompoundStructure.GetMinimumLayerThickness
Get the minimum allowable layer thickness.
Returns:
The minimum allowable width of a layer in feet.

Autodesk.Revit.DB.CompoundStructure.CreateSingleLayerCompoundStructure(System.Double,Autodesk.Revit.DB.MaterialFunctionAssignment,System.Double,Autodesk.Revit.DB.ElementId)
Creates a vertically compound CompoundStructure with one layer.
Remarks:
It is not verified that materialId corresponds to a valid MaterialElem.
sampleHeight:
The sample height of this vertically compound structure.
layerFunction:
The function of the single layer.
width:
The width of the single layer.
materialId:
The ElementId of the material for the single layer.
Returns:
The newly created compound structure.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for sampleHeight must be greater than 0 and no more than 30000 feet.
-or-
The given value for width must be greater than 0 and no more than 30000 feet.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.CreateSingleLayerCompoundStructure(Autodesk.Revit.DB.MaterialFunctionAssignment,System.Double,Autodesk.Revit.DB.ElementId)
Creates a CompoundStructure containing a single layer.
Remarks:
It is not verified that materialId corresponds to a valid Material element.
layerFunction:
The function of the single layer.
width:
The width of the single layer.
materialId:
The ElementId of the material for the single layer.
Returns:
The newly created compound structure.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for width must be greater than 0 and no more than 30000 feet.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.CreateSimpleCompoundStructure(System.Collections.Generic.IList{Autodesk.Revit.DB.CompoundStructureLayer})
Creates a non-vertically compound structure comprised of parallel layers.
Remarks:
All layers are in the core, i.e. there are no shell layers created.
layers:
An array which describes the parallel layers of this compound structure.
Returns:
A newly created compound structure.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more layers is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructure.GetLastCoreLayerIndex
Gets the index of the last core layer.
Remarks:
This is the index on the interior side.  You can change the shell/core layer boundary
using Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32).
Returns:
The index of the last core layer.

Autodesk.Revit.DB.CompoundStructure.GetFirstCoreLayerIndex
Gets the index of the first core layer.
Remarks:
This is the index on the exterior side.  You can change the shell/core layer boundary
using Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32).
Returns:
The index of the first core layer.

Autodesk.Revit.DB.CompoundStructure.GetOffsetForLocationLine(Autodesk.Revit.DB.WallLocationLine)
Returns the offset from the center of the compound structure to the given location line value.
wallLocationLine:
The alignment type of the wall's location line.
Returns:
The offset.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only vertically homogeneous compound structures.

Autodesk.Revit.DB.CompoundStructure.GetCoreBoundaryLayerIndex(Autodesk.Revit.DB.ShellLayerType)
Returns the index of the layer just below the core boundary.
Remarks:
-1 returned if there is no such a layer.  You can change the shell/core layer boundary
using Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32).
shellLayerType:
If ShellLayerType.Exterior return the index on the exterior side (or top side for a roof, floor, or ceiling type).
If ShellLayerType.Interior return the index on the interior side (or bottom side for a roof, floor, or ceiling type).
Returns:
The index of the layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.GetPreviousNonZeroLayerIndex(System.Int32)
Returns the index of the nearest non-zero width layer before this layer.
Remarks:
If this layer is non-zero width, it will be returned. If there are non-zero width layers found, returns -1.
thisIdx:
The layer from which to look for a non-zero width layer.
Returns:
The index of the layer found.

Autodesk.Revit.DB.CompoundStructure.ClearWallSweeps(Autodesk.Revit.DB.WallSweepType)
Removes all sweeps or reveals from the compound structure.
wallSweepType:
The type of a wall sweep.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.RemoveWallSweep(Autodesk.Revit.DB.WallSweepType,System.Int32)
Removes a single sweep or reveal from the compound structure.
Remarks:
No validation of input arguments is performed. If no reveal or sweep
has the specified id, no action is performed.
wallSweepType:
The type of a wall sweep.
id:
The id of the sweep or reveal to remove.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.AddWallSweep(Autodesk.Revit.DB.WallSweepInfo)
Adds a new wall sweep or reveal to the compound structure.
Remarks:
A wall sweep is an object that is created by sweeping a closed 2d profile along a horizontal line
that is positioned on one side (exterior or interior) of the hosting wall.
A reveal is a special wall sweep with a void shape that is subtracted from the hosting wall.
The id field of the WallSweepInfo must be populated with a non-negative integer value.
If there already is a sweep defined for this id, its parameters will be changed.
A new sweep will be created if no existing one has matching id.
wallSweepInfo:
The wall sweep info to create a wall sweep.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The wall sweep info does not represent a fixed wall sweep.  Only fixed wall sweeps may be assigned to vertical compound structures.
-or-
The WallSweepInfo has an invalid id for a fixed wall sweep.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetWallSweepsInfo(Autodesk.Revit.DB.WallSweepType)
Obtains a list of the intrinsic wall sweeps or reveals in this CompoundStructure.
wallSweepType:
Whether to obtain wall sweeps or reveals.
Returns:
An array which describes the intrinsic wall sweeps or reveals.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.ChangeRegionWidth(System.Int32,System.Double)
Adjust the width of an existing simple region.
Remarks:
If width is changed to zero, the effect is to delete the region.
regionId:
The id of a region.
newWidth:
The desired width of the specified region.
Returns:
True if newWidth is zero and the region was deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid region id.
-or-
It is not a simple region.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetRegionsAlongLevel(System.Double)
Returns the ids of the regions encountered as the vertically compound structure is traversed
at a constant height above the bottom a wall to which this structure is applied.
height:
Distance from the bottom of the wall.
Returns:
The ids of the regions intersected by the specified line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The height is outside valid range. It should be in the range of [0, SampleHeight].

Autodesk.Revit.DB.CompoundStructure.SetExtendableRegionIds(System.Boolean,System.Collections.Generic.IList{System.Int32})
Sets the extendable region ids for the compound structure.
Remarks:
Regions along the top or bottom of the wall may be set to be extendable.
top:
If true, set ids of regions which are extendable at the top, otherwise
set the ids of regions which are extendable at the bottom.
regionIds:
The ids of regions which will be extendable.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The region ids are not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetExtendableRegionIds(System.Boolean)
Gets the extendable region ids for the compound structure.
Remarks:
Regions along the top or bottom of the wall may be set to be extendable.
top:
If true, retrieve ids of regions which are extendable at the top, otherwise
retrieve the ids of regions which are extendable at the bottom.
Returns:
An array of region ids which are marked extendable.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.FindEnclosingRegionAndSegments(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.RectangularGridSegmentOrientation,System.Int32@,System.Int32@)
Given a pair of grid coordinates, and a direction for splitting, returns the enclosing region and the two segments
intersected by a line through the grid point.
Remarks:
Grid coordinates correspond to uv coordinates of faces.
gridUV:
Coordinates of a point in the rectangular grid of this compound structure.
splitDirection:
Specifies the direction of the split.
segmentId1:
The id of a segment in the boundary of the containing region which is split by a line through gridUV in the specified direction.
segmentId2:
The id of a segment in the boundary of the containing region which is split by a line through gridUV in the specified direction.
Returns:
Returns the id of the enclosing region, and -1 if no region encloses the point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.SplitRegion(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.RectangularGridSegmentOrientation)
Splits the region which contains the specified grid point by a line with the specified direction.
Remarks:
This method is meant to be used in conjunction with Autodesk.Revit.DB.CompoundStructure.FindEnclosingRegionAndSegments(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.RectangularGridSegmentOrientation,System.Int32@,System.Int32@).
Grid coordinates correspond to uv coordinates of faces.
gridUV:
Coordinates of a point in the rectangular grid of this compound structure.
splitDirection:
Specifies the direction of the split.
Returns:
The id of the region created by this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.SplitRegion(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.RectangularGridSegmentOrientation,System.Int32@)
Splits the region which contains the specified grid point by a line with the specified direction.
Remarks:
This method is meant to be used in conjunction with Autodesk.Revit.DB.CompoundStructure.FindEnclosingRegionAndSegments(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.RectangularGridSegmentOrientation,System.Int32@,System.Int32@).
Grid coordinates correspond to uv coordinates of faces.
gridUV:
Coordinates of a point in the rectangular grid of this compound structure.
splitDirection:
Specifies the direction of the split.
newSegmentId:
The id of segment that bounds both the original region and the new region.
Returns:
The id of the region created by this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.MergeRegionsAdjacentToSegment(System.Int32,System.Int32)
Merges the two regions which share the specified segment.
segmentId:
The id of a segment in the underlying grid.
layerIdxForMergedRegion:
The index of the layer to which the resulting region will be associated.
Returns:
The id of the resulting region. If -1 is returned, then the operation would have produced
an invalid region and was not performed.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.
-or-
The segment is not shared by adjacent regions.

Autodesk.Revit.DB.CompoundStructure.GetSegmentEndPoints(System.Int32,System.Int32,Autodesk.Revit.DB.UV@,Autodesk.Revit.DB.UV@)
Gets the end points of a segment.
segmentId:
The segment id.
regionId:
The region id.
end1:
One end point.
end2:
The other end point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The segment id is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetSegmentCoordinate(System.Int32)
Gets the coordinate of a segment.
Remarks:
The boundaries of the regions of a vertically compound structure consist of vertical
horizontal segments.
If the segment orientation is horizontal, then its coordinate will lie in the range [0.0, SampleHeight].
If the segment orientation is vertical, then its coordinate will lie in the range of u values obtained from
Autodesk.Revit.DB.CompoundStructure.GetRegionEnvelope(System.Int32).
segmentId:
The id of a segment in this CompoundStructure.
Returns:
The local coordinates of the specified segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The segment id is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetRegionEnvelope(System.Int32)
Gets the envelope that a specified region spans.
Remarks:
This envelope indicates the external boundary of the region.  The
coordinate system it defines is used in the results of GetSegmentCoordinate().
regionId:
The id of the region.
Returns:
The envelope of the region.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid region id.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetSegmentOrientation(System.Int32)
Gets the orientation of a segment.
Remarks:
The boundaries of the regions of a vertically compound structure consist of vertical
horizontal segments.
segmentId:
The id of a segment in this CompoundStructure.
Returns:
The orientation of the specified segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The segment id is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetAdjacentRegions(System.Int32)
Gets the ids of region bound to a specified segment.
Remarks:
The boundaries of the regions of a vertically compound structure consist of vertical
horizontal segments with unique ids.
The segments which define the outer boundary of the structure are adjacent to one region,
other segments will be adjacent to two regions.
segmentId:
The id of a segment in this CompoundStructure.
Returns:
The ids of the regions that are bounded by the specified segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The segment id is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.IsValidSegmentId(System.Int32)
Determines whether the specified integer is actually the id of a segment in this CompoundStructure.
segmentId:
The id of a segment in this CompoundStructure.
Returns:
True if the specified segment is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.IsRectangularRegion(System.Int32)
Determines whether the specified region is rectangular.
regionId:
The id of a region.
Returns:
True if the specified region is a rectangle, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid region id.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.IsSimpleRegion(System.Int32)
Determines whether the region is a simple region in this CompoundStructure.
Remarks:
A region is simple if it rectangular and spans the height of the wall.
regionId:
The id of a region in this vertically compound structure.
Returns:
True if the region is simple, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid region id.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.IsValidRegionId(System.Int32)
Determines whether the specified integer is actually the id of a region in this CompoundStructure.
regionId:
The id of a region in this vertically compound structure.
Returns:
True if the region is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetSegmentIds
Gets the segment ids of this compound structure.
Remarks:
The boundaries of the regions of a vertically compound structure consist of vertical
horizontal segments with unique ids.
Returns:
The ids of the segments which form the boundary of the regions of this CompoundStructure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetRegionIds
Gets the region ids of this compound structure.
Remarks:
A vertically compound structure consists of regions with polygonal boundaries.
Returns:
The ids of the regions defining this CompoundStructure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.AssociateRegionWithLayer(System.Int32,System.Int32)
Associates a region with a layer.
regionId:
The id of a region.
layerIdx:
The index of a layer in this CompoundStructure.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid region id.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetLayerAssociatedToRegion(System.Int32)
Gets the layer associated to a particular region.
regionId:
The id of a region.
Returns:
The index of a layer in this CompoundStructure.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
For a non-vertically compound structure, implicitly each layer is associated to its corresponding simple region.

Autodesk.Revit.DB.CompoundStructure.GetRegionsAssociatedToLayer(System.Int32)
Gets the set of region ids associated to a particular layer.
Remarks:
Regions are associated to layers. In a vertically compound structure, more than one region may be associated to a
single layer.
layerIdx:
The index of a layer in this CompoundStructure.
Returns:
An array of region ids which are associated to the specified layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.IsValidSampleHeight(System.Double)
Is the specified height a valid sample height for this compound structure?
Remarks:
The sample height cannot be less than the value of MinimumSampleHeight.

Autodesk.Revit.DB.CompoundStructure.IsLayerValid(System.Int32,Autodesk.Revit.DB.CompoundStructureLayer)
Verifies that the data in this layer is internally consistent.
Remarks:
If the layer function is not Membrane or StructuralDeck, the width must be greater than zero.
If the layer function is not StructuralDeck, then the deck embedding type must be Invalid, and the deck profile id must be InvalidElementId.
layerIdx:
The index of the layer in the compound structure to be set.
layer:
The layer to be set.
Returns:
True if the layer is internally consistent, false if the layer is not internally consistent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructure.IsCoreLayer(System.Int32)
Checks if the specified layer is a core layer.
Remarks:
You can change the shell/core layer boundary using Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32).
layerIdx:
The index of a layer in this CompoundStructure.
Returns:
Returns true if the layer is within the core layer boundary, false if it is in the interior or exterior shell layers.

Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32)
Sets the number of interior or exterior shell layers.
Remarks:
There must be at least one core layer, i.e. one layer which is not a shell layer.
shellLayerType:
If ShellLayerType.Exterior set the number of exterior shell layers (or top shell layers for a roof, floor, or ceiling type).
If ShellLayerType.Interior set the number of interior shell layers (or bottom shell layers for a roof, floor, or ceiling type).
numLayers:
The number of layers to be in the specified shell.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Number of shell layers is negative.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Too many shell layers: there must be at least one core layer.

Autodesk.Revit.DB.CompoundStructure.GetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType)
Retrieves the number of interior or exterior shell layers.
Remarks:
There will always be at least one core layer, i.e. one layer which is not a shell layer.  You can change the shell/core layer
boundary using Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32).
shellLayerType:
If ShellLayerType.Exterior return the number of exterior shell layers (or top shell layers for a roof, floor, or ceiling type).
If ShellLayerType.Interior return the number of interior shell layers (or bottom shell layers for a roof, floor, or ceiling type).
Returns:
The number of shell layers in the interior or exterior shell, as specified by shellLayerType.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.GetWidth
The width implied by this compound structure.
Remarks:
If the structure is not vertically compound, then
this is simply the sum of all layers' widths.  If the structure is vertically compound,
this is the width of the rectangular grid stored in the vertically compound structure.
The presence of a layer with variable width has no effect on the value returned by this method. The
value returned assumes that all layers have their specified width.
Returns:
The width of a host object with this compound structure.

Autodesk.Revit.DB.CompoundStructure.SetParticipatesInWrapping(System.Int32,System.Boolean)
Assigns if a layer is included in wrapping at inserts and ends.
Remarks:
This method applies only to interior and exterior shell layers.
layerIdx:
The index of the layer.
participatesInWrapping:
True if the specified layer will participate in wrapping at inserts and ends, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The wrapping of the layer is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.ParticipatesInWrapping(System.Int32)
Identifies if a layer is included in wrapping at inserts and ends.
Remarks:
This method applies only to interior and exterior shell layers.
layerIdx:
The index of the layer.
Returns:
If true, then the layer participates in wrapping at inserts and openings. If false, the layer will not
participate in wrapping.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.SetLayer(System.Int32,Autodesk.Revit.DB.CompoundStructureLayer)
Sets a single layer for this CompoundStructure.
Remarks:
This function does not support addition of new layers, use SetLayers() to change the number of layers.
layerIdx:
The index of a layer. This should range from 0 to the number of layers - 1.
layer:
The layer to be set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The layer is not valid for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for non-vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.SetLayers(System.Collections.Generic.IList{Autodesk.Revit.DB.CompoundStructureLayer})
Completely resets this CompoundStructure and applies a new set of layers.
Remarks:
This function will replace all existing layers with the contents of the input.  This provides a full
reset for the CompoundStructure. Therefore:
All layers will be marked as Core layers, and any settings related to Shell layers (such as Autodesk.Revit.DB.CompoundStructure.GetFirstCoreLayerIndex,
Autodesk.Revit.DB.CompoundStructure.GetLastCoreLayerIndex or Autodesk.Revit.DB.CompoundStructure.GetCoreBoundaryLayerIndex(Autodesk.Revit.DB.ShellLayerType)) will be modified accordingly.Because all layers will be set as Core layers, the value of LayerCapFlag will be ignored (and set to true) automatically.The Autodesk.Revit.DB.CompoundStructure.VariableLayerIndex will be unset.The Autodesk.Revit.DB.CompoundStructure.StructuralMaterialIndex will be unset.The compound structure will be set to be vertically homogeneous.
layers:
The layers to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructure.SetDeckEmbeddingType(System.Int32,Autodesk.Revit.DB.StructDeckEmbeddingType)
Sets the deck embedding type to use for the specified structural deck.
layerIdx:
Index of a layer in the CompoundStructure.
embedType:
The embedding type to be used by the specified layer if it is a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The layer is not a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.GetDeckEmbeddingType(System.Int32)
Retrieves the deck embedding type used for the specified structural deck.
layerIdx:
Index of a layer in the CompoundStructure.
Returns:
The embedding type of the structural deck associated to the specified layer. Invalid if it is not a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.SetDeckProfileId(System.Int32,Autodesk.Revit.DB.ElementId)
Sets the profile loop to use for the specified structural deck.
layerIdx:
Index of a layer in the CompoundStructure.
profileId:
The element id of a FamilySymbol which contains a profile loop to be used by the specified layer if it is a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The layer is not a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.GetDeckProfileId(System.Int32)
Retrieves the profile loop used for the specified structural deck.
layerIdx:
Index of a layer in the CompoundStructure.
Returns:
The element id of a FamilySymbol which contains a profile loop used by a structural deck associated to the specified layer,
or invalidElementId if isStructuralDeck(layerIdx) is false.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.IsStructuralDeck(System.Int32)
Determines whether a specified layer is a structural deck.
layerIdx:
Index of a layer in the CompoundStructure.
Returns:
True if specified layer is a structural deck, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.SetLayerFunction(System.Int32,Autodesk.Revit.DB.MaterialFunctionAssignment)
Sets the function of the specified layer.
layerIdx:
Index of a layer in the CompoundStructure.
function:
The function of the layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.GetLayerFunction(System.Int32)
Retrieves the function of the specified layer.
Remarks:
The function determines how this layer interacts with the layers of other elements to which it is joined.
layerIdx:
Index of a layer in the CompoundStructure.
Returns:
The function of the layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.GetWidth(System.Int32)
Computes the width of the envelope (2d bounding box) of the specified region.
regionId:
The id of a region in this vertically compound structure.
Returns:
The width of the envelope (2d bounding box) of the region.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid region id.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.CanLayerWidthBeNonZero(System.Int32)
Identifies if changing the width of an existing layer from zero to a positive value will create a rectangular region.
Remarks:
This is only allowed if there is a vertical line such that all regions to the left are assigned to layers with index < layerIdx,
and all regions to the right are assigned to layers with index > layerIdx.
layerIdx:
The index of a CompoundStructureLayer.

Autodesk.Revit.DB.CompoundStructure.SetLayerWidth(System.Int32,System.Double)
Sets the width of a specified layer.
Remarks:
If the structure is vertically compound, and the layer is associated to a single simple region,
the width of that region is adjusted. If layerIdx is 0 or LayerCount-1,
and there is no associated region in the VerticalRegionsStructure, one will be created and associated to the layer.
If the specified layer index is associated to a simple region, and the width is set to 0.0, that region will be deleted.
layerIdx:
Index of a layer in the CompoundStructure.
width:
The new width of the specified layer.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The width of the layer is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If the region of the layer is not a simple region.

Autodesk.Revit.DB.CompoundStructure.GetLayerWidth(System.Int32)
Retrieves the width of a specified layer.
layerIdx:
Index of a layer in the CompoundStructure.
Returns:
The width of the specified layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.GetMaterialId(System.Int32)
Retrieves the material element id of a specified layer.
layerIdx:
Index of a layer in the CompoundStructure.
Returns:
The material element id.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.SetMaterialId(System.Int32,Autodesk.Revit.DB.ElementId)
Sets a material element for a specified layer.
Remarks:
It is not verified that materialId corresponds to a valid Material element.
layerIdx:
Index of a layer in the CompoundStructure.
materialId:
The ElementId of a Material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.DeleteLayer(System.Int32)
Deletes the specified layer from this CompoundStructure.
Remarks:
For a vertically compound structure, a layer
may only be deleted if it is not associated to a region, or else it is associated to exactly one simple
region, which will also be deleted. Regions associated to layers with index greater than layerIdx will
have their associated layer indices decremented by one.
layerIdx:
The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Returns:
True if the layer was successfully deleted, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The layer cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.GetSimpleCompoundStructure(System.Double,System.Double)
Takes a horizontal slice through a sample wall to which this CompoundStructure is applied
and returns a simple compound structure which describes that slice, i.e. a series of
parallel layers.
Remarks:
If Autodesk.Revit.DB.CompoundStructure.IsVerticallyCompound is false, the output is a copy of this CompoundStructure.
wallHeight:
The height of the wall.
distAboveBase:
The distance from the base of the wall at which to take the section.
If distAboveBase < 0, then internally distAboveBase = 0 is used.
If distAboveBase > wallHeight, then internally distAboveBase = wallHeight is used.
Returns:
A simple CompoundStructure representing a series of parallel layers.

Autodesk.Revit.DB.CompoundStructure.IsValid(Autodesk.Revit.DB.Document,System.Collections.Generic.IDictionary{System.Int32,Autodesk.Revit.DB.CompoundStructureError}@,System.Collections.Generic.IDictionary{System.Int32,System.Int32}@)
Checks for errors or inconsistencies in the data in this CompoundStructure.
Remarks:
This check is run before the CompoundStructure may be assigned to a particular ElementType.
doc:
Access to the document in which the CompoundStructure will be used.
errMap:
This map will associate each problematic layer index to a value in CompoundStructureError.
General structure errors are reported as associated to layer index -1.
twoLayerErrorsMap:
The map is associated to a check run only for vertically Compound Structures.
Essentially the Compound Structure is sliced at representative heights.
It looks at the region from exterior to interior, and requires that the assigned layer indices do not decrease.
If they do, an entry is generated for this map. The first entry is the last valid layer index encountered.
The second entry is a region id whose assigned layer index is too small: it should be at least as large as the first entry.
Returns:
True if the compound structure is valid for the document, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructure.IsVerticallyHomogeneous
Indicates whether this CompoundStructure represents a single set of parallel layers.
Remarks:
Differs from IsVerticallyCompound as a vertically compound structure might happen not to have
any horizontal breaks. For that situation, both IsVerticallyCompound and this method will return true.
Returns:
True if this CompoundStructure represents a series of parallel layers that stretch from bottom to top, false otherwise.

Autodesk.Revit.DB.CompoundStructure.IsEqual(Autodesk.Revit.DB.CompoundStructure)
Checks whether this CompoundStructure is the same as another CompoundStructure.
otherStructure:
A CompoundStructure.
Returns:
True if the two CompoundStructures are the same, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructure.GetLayers
A copy of the layers which define this compound structure.
Returns:
The layers, returned in order (Exterior to Interior for walls, top to bottom for roofs, floors or ceilings). The index of each layer in this array
can be used in other CompoundStructure methods accepting a layer index.

Autodesk.Revit.DB.CompoundStructure.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CompoundStructure.MinimumSampleHeight
The minimum sample height determined by the current sample height and the horizontal segments.
Remarks:
All horizontal segments dimensioned to the top must remain strictly above all horizontal segments
dimensioned to the bottom.

Autodesk.Revit.DB.CompoundStructure.CutoffHeight
Horizontal segments below or at the cutoff height have their distance to the wall bottom fixed, those above
have their distance to the wall top fixed.
Remarks:
This allows layers with one horizontal segment above and one below
this line to be of variable height.
The cutoff height of this CompoundStructure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.SampleHeight
The sample height is the presumed height of the wall to which the data in this CompoundStructure is applied.
Remarks:
This value has meaning only for vertically compound structures.
In order to apply this CompoundStructure to a wall whose height differs from the sample height,
the underlying grid will be rescaled.
The height of the wall used to define the vertically compound structure.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value newSampleHeight is smaller than the value of MinimumSampleHeight.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.StructuralMaterialIndex
Indicates the layer whose material defines the structural properties of the type for the purposes of analysis.
The index of the layer containing the structural material properties.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The specified layer cannot define the structural material properties of the type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The layer index is invalid.

Autodesk.Revit.DB.CompoundStructure.VariableLayerIndex
Indicates the index of the layer which is designated as variable.
Remarks:
If the host object to which it is applied
has an actual width that exceeds the total width of all layers, then all layers except the variable layer
will be created with their specified width, and the variable layer will expand to take up the slack.
Generally this is applicable for floors and roofs with shape edits applied. There can be only one variable layer.
In the wall compound structure UI, when a layer is labeled 'variable' in the thickness column,
that means it is assigned either to a non-rectangular region, or it means the layer is assigned to two different layers.
Neither of those situations is what this method refers to.
The index of the layer specified as variable. If there is no variable layer, this value is -1.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The specified layer cannot be set to a variable layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The layer index is invalid.

Autodesk.Revit.DB.CompoundStructure.OpeningWrapping
Indicates the opening wrapping condition defining which shell layers of a wall, in plan view, wrap at inserts and openings.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.EndCap
Indicates the end cap condition defining which shell layers will participate in end wrapping.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.HasStructuralDeck
Checks if the compound structure has a structural deck.

Autodesk.Revit.DB.CompoundStructure.IsVerticallyCompound
Identifies if this CompoundStructure represents a layout that is more complicated than a simple set of parallel layers.
Remarks:
Vertically compound structures should be assigned only to walls.

Autodesk.Revit.DB.CompoundStructure.LayerCount
Returns the number of layers contained in this CompoundStructure.
Remarks:
Establishes the valid range of indices passed to various access functions: [0 ... this value - 1]

Autodesk.Revit.DB.CompoundStructure.IsEmpty
Checks whether this CompoundStructure is empty.

Autodesk.Revit.DB.CompoundStructure
Describes the internal structure of a wall, floor, roof or ceiling.
Remarks:
A compound structure consists a collection of ordered layers, proceeding from exterior to interior for a wall, or from top to bottom for a
floor, roof or ceiling. The properties of these layers determine the
thickness, material, and function of the overall structure of the associated wall, floor, roof or ceiling.  Layers can
be accessed via the Autodesk.Revit.DB.CompoundStructure.GetLayers method and completely replaced using SetLayers.  Layers
can also be accessed and modified individually using the "layer index", which is a value from in the range [0, LayerCount)
identifying the layer in the structure.
A structure supports the concept of "core layers" and "shell layers".  There are two layer indices which identify
where the boundary between core and shell layers occur in the list of layers.  The boundaries between shell and core layers
are identifiable using
Autodesk.Revit.DB.CompoundStructure.GetFirstCoreLayerIndex, Autodesk.Revit.DB.CompoundStructure.GetLastCoreLayerIndex, Autodesk.Revit.DB.CompoundStructure.GetCoreBoundaryLayerIndex(Autodesk.Revit.DB.ShellLayerType)
or Autodesk.Revit.DB.CompoundStructure.GetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType).  The core layer boundary can be changed with Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32).
Compound structures may be vertically compound.  If Autodesk.Revit.DB.CompoundStructure.IsVerticallyCompound is false,
the CompoundStructure describes a series of parallel layers, each with specified width, function, material and other properties.
If Autodesk.Revit.DB.CompoundStructure.IsVerticallyCompound is true (which should apply only for CompoundStructures assigned to walls) then
horizontal sections at different elevations may have different layered
structures. In this case, the structure describes a vertical section via a rectangle
which is divided into polygonal regions whose sides are all vertical or horizontal segments.
A map associates each of these regions with the index of a layer in the CompoundStructure which
determines the properties of that region.